
#include<stdio.h>
#include<stdlib.h>
//定义字符数组打印 死 字 
char si[10][15] = 
{
	{'$','$','$','$','$','$','$','$','$','$','$','$','$','$','$'},
	{' ',' ',' ','$',' ',' ','$','$',' ',' ',' ',' ',' ',' ',' '},
	{' ',' ',' ','$','$','$','$','$',' ',' ',' ',' ',' ',' ',' '},
	{' ',' ','$',' ','$','$',' ','$',' ',' ',' ',' ',' ',' ',' '},
	{' ','$','$',' ','$',' ',' ','$','$','$','$','$',' ',' ',' '}, 
	{'$',' ','$','$',' ',' ',' ','$',' ',' ',' ',' ',' ',' ',' '},
	{' ',' ','$',' ',' ',' ',' ','$',' ',' ',' ',' ',' ',' ',' '},
	{' ','$',' ',' ',' ',' ',' ','$',' ',' ',' ',' ',' ','$',' '},
	{'$',' ',' ',' ',' ',' ',' ','$',' ',' ',' ',' ',' ','$',' '},
	{' ',' ',' ',' ',' ',' ',' ','$','$','$','$','$','$','$',' '}
} ;
int main()
{
	system("title 死死死死死死死死死死") ;//改变标题显示，不然默认显示文件的绝对路径 
	for(int i=0;i<10;i++)//外层循环代表你有多少行 
	{
		for(int j=0;j<15;j++)//内层循环代表你有多少列
		{
			//printf("%2c",si[i][j]);//打印 死 
			if (si[i][j]!=' ')
			{
				printf(" 0");
			}
			else
				printf("  ");
		} 
		 printf("\n") ;
	}
	while(1)
	{
		for(int i=0;i<16;i++)//循环 
		{
			char str[30];//容纳变色指令
			sprintf(str,"color %x%x",i,16-i);//打印字符串 
			system(str);//执行变色 
		}	
	}
	getchar();
	return 0;
 }
 /*
 sprintf()最常见的应用之一莫过于把整数打印到字符串中，如：
    sprintf(s, "%d", 123);  //把整数123打印成一个字符串保存在s中
    sprintf(s, "%8x", 4567);  //小写16进制，宽度占8个位置，右对齐
	*/