#include <stdio.h>
#include "windows.h"

int main(int argc, char *argv[])
{
	system("color 70");
	int i,j;
	int a[317],b[66],c[100000];
	j=1;
	//数组赋初值
	for (i=2;i<=317 ;i++ )
	{
		a[i]=i;
	}
	//在数组a中用2、3、5、7、11、13、17、19去筛。剩下的就是素数
	//此法比较拙劣
/*	for (i=2;i<=317 ;i++ )
	{
		if ((i%2==0&&i!=2)||(i%3==0&&i!=3)||(i%5==0&&i!=5)||(i%7==0&&i!=7)||(i%11==0&&i!=11)||(i%13==0&&i!=13)||(i%17==0&&i!=17)||(i%19==0&&i!=19))
		{
			a[i]=0;
		}
	}
	*/
	int d[]={2,3,5,7,11,13,17,19};
	for (i=2;i<=317 ;i++ )
	{
		for (j=0;j<8 ;j++ )
		{
			if (a[i]%d[j]==0&&a[i]!=d[j])
			{
				a[i]=0;
			}
		}
	}

	//把317以内的素数存放在数组b中
	for (i=2,j=0;i<=317 ;i++ )
	{
		if (a[i]!=0)
		{
			b[j++]=a[i];
		}
	}
	printf("\n输出数组b(317以内的素数):\n");
	for (i=0;i<66 ;i++ )
	{
		printf("%5d",b[i]);
		if ((i+1)%10==0)
		{
			printf("\n");
		}
	}
	//对数组c[10000]赋初值
	for (i=2;i<100000 ;i++ )
	{
		c[i]=i;
	}
	//用数组b[]中的元素去逐一筛数组c[10000]
	for (j=0;j<66 ;j++ )
	{
		for (i=2;i<100000 ;i++ )
		{
			if (c[i]%b[j]==0&&c[i]!=0&&c[i]!=b[j])
			{
				c[i]=0;
			}
		}
	}

	printf("\n输出100000以内的素数\n");
	for (i=2,j=0;i<100000 ;i++ )
	{
		if (c[i]!=0)
		{
			printf("%6d",c[i]);
			j++;
		}
		if (j%10==0&&c[i]!=0)
		{
			printf("\n");
		}
	}
	return 0;
}
